[
    {
        "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
        "author": "Стив Макконнелл"
    },
    {
        "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
        "author": "Артур Блох. Законы Мэрфи"
    },
    {
        "text": "Ходить по воде и разрабатывать программы, следуя ТЗ, очень просто… если они заморожены",
        "author": "И. Берард"
    },
    {
        "text": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили",
        "author": "Mosher’s Law of Software Engineering"
    },
    {
        "text": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь",
        "author": "Thomas C. Gale"
    },
    {
        "text": "В теории, теория и практика неразделимы. На практике это не так",
        "author": "Yoggi Berra"
    },
    {
        "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня",
        "author": "Larry Wall"
    },
    {
        "text": "Отладка кода — это как охота. Охота на баги",
        "author": "Amit Kalantri"
    },
    {
        "text": "Работает? Не трогай",
        "author": "Любой программист"
    },
    {
        "text": "Есть всего два типа языков программирования: те, на которые люди всё время ругаются, и те, которые никто не использует",
        "author": "Bjarne Stroustrup"
    },
    {
        "text": "Неработающая программа обычно приносит меньше вреда, чем работающая плохо",
        "author": "Dave Thomas"
    },
    {
        "text": "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать",
        "author": "Alexander Golov"
    },
    {
        "text": "Преждевременная оптимизация — корень всех зол",
        "author": "Donald Knuth"
    },
    {
        "text": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его",
        "author": "Robert Martin"
    },
    {
        "text": "Для каждой сложной задачи существует решение, которое является быстрым, простым и неправильным",
        "author": "H.L. Mencken"
    },
    {
        "text": "Тестирование не позволяет обнаружить такие ошибки, как создание не того приложения",
        "author": "Jamie Zawinski"
    },
    {
        "text": "Нельзя доверять коду, который вы не написали полностью сами",
        "author": "Ken Thompson"
    },
    {
        "text": "Доказательство с помощью аналогий — это обман",
        "author": "Bjarne Stroustrup"
    },
    {
        "text": "Модульность — фундаментальный аспект всех успешно работающих крупных систем",
        "author": "Bjarne Stroustrup"
    }
]